paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_lr4_301_drv.c
#include <math.h>
#include "Efm8lb12_pid.h"
#include "Efm8lb12_adc.h"
#include "Efm8lb12_msa.h"
#include "Efm8lb12_smbus.h"
#include "Efm8lb12_common.h"
#include "Efm8lb12_msa_pin.h"
#include "Efm8lb12_100g_com_drv.h"

#ifdef EFM8LB12E64_100G_SFP_LR4_301

static uint8_t _i2c_dev_ready = 0;

/********************************* DRV API Interface ****************************************/
static bool _lr4_301_txcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if(TX3V3_EN == 1)
#else
	if(TX3V3_EN == 0)
#endif
	{
		MSA_p2_log("\r\ntxcdr is lower power mode");
		return false;
	}

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == SMB_read_byte(LR4_TXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\ntxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\ntxcdr smb read failed");
		}
		TIMER5_hw_delay_us(5000);
	}

	return false;
}

static bool _lr4_301_rxcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if(TX3V3_EN == 1)
#else
	if(TX3V3_EN == 0)
#endif
	{
		MSA_p2_log("\r\nrxcdr is lower power mode");
		return false;
	}

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == SMB_read_byte(LR4_RXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\nrxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\nrxcdr smb read failed");
		}
		TIMER5_hw_delay_us(5000);
	}

	return false;
}

static bool _lr4_301_tosa_check_exist()
{
	uint8_t i = 0, Data = 0;

#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if(TX3V3_EN == 1)
#else
	if(TX3V3_EN == 0)
#endif
	{
		MSA_p2_log("\r\ntosa is lower power mode");
		return false;
	}

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == SMB_read_byte(LR4_TOSA_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\ntosa smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\ntosa smb read failed");
		}
		TIMER5_hw_delay_us(5000);
	}
	return false;
}

static uint8_t _lr4_301_txcdr_m37049_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if((TX3V3_EN == 1) ||((_i2c_dev_ready & TX_READY) == 0x0))
#else
	if((TX3V3_EN == 0) ||((_i2c_dev_ready & TX_READY) == 0x0))
#endif
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(LR4_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _lr4_301_txcdr_m37049_i2c_write_byte(uint8_t OffsetAddr, uint8_t Data)
{
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if((TX3V3_EN == 1) || ((_i2c_dev_ready & TX_READY) == 0x0))
#else
	if((TX3V3_EN == 0) || ((_i2c_dev_ready & TX_READY) == 0x0))
#endif
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(LR4_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _lr4_301_rxcdr_m37046_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if((TX3V3_EN == 1) || ((_i2c_dev_ready & RX_READY) == 0x0))
#else
	if((TX3V3_EN == 0) || ((_i2c_dev_ready & RX_READY) == 0x0))
#endif
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(LR4_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _lr4_301_rxcdr_m37046_i2c_write_byte(uint8_t OffsetAddr,uint8_t Data)
{
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if((TX3V3_EN == 1) || ((_i2c_dev_ready & RX_READY) == 0x0))
#else
	if((TX3V3_EN == 0) || ((_i2c_dev_ready & RX_READY) == 0x0))
#endif
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(LR4_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _lr4_301_tosa_m4820_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if((TX3V3_EN == 1) || ((_i2c_dev_ready & TOSA_READY) == 0x0))
#else
	if((TX3V3_EN == 0) || ((_i2c_dev_ready & TOSA_READY) == 0x0))
#endif
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(LR4_TOSA_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _lr4_301_tosa_m4820_i2c_write_byte(uint8_t OffsetAddr,uint8_t Data)
{
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
	if((TX3V3_EN == 1) || ((_i2c_dev_ready & TOSA_READY) == 0x0))
#else
	if((TX3V3_EN == 0) || ((_i2c_dev_ready & TOSA_READY) == 0x0))
#endif
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(LR4_TOSA_BASE_ADDR, OffsetAddr, Data);
}

static void _lr4_301_port0_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x0;
	//1.set port default value
#ifdef HW_VER_AM1_301
	P0 = P0_B0__LOW | P0_B1__HIGH | P0_B2__HIGH | P0_B3__LOW | P0_B4__HIGH | P0_B5__HIGH | P0_B6__HIGH | P0_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P0MDIN = P0MDIN_B0__DIGITAL   					   //set p0.0 digital mode  is used for TX circuit voltage enable
			| P0MDIN_B1__ANALOG | P0MDIN_B2__ANALOG    //set p0.1 and p0.2 analog mode is used for monitor TEC current and voltage
			| P0MDIN_B3__DIGITAL 					   //set p0.3 digital mode is used for TEC enable
			| P0MDIN_B4__DIGITAL | P0MDIN_B5__DIGITAL  //set p0.4 and p0.5 digital mode is used for uart0
			| P0MDIN_B6__ANALOG 					   //set p0.6 analog mode is used for mointor thermal resistor  temperature
			| P0MDIN_B7__DIGITAL;					   //set p0.7 digital mode is used for QSFP  interrupt output


	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P0MDOUT = P0MDOUT_B0__PUSH_PULL    							//set p0.0 push pull is used for TX circuit voltage enable
			| P0MDOUT_B1__OPEN_DRAIN | P0MDOUT_B2__OPEN_DRAIN	//because the p0.1 and p0.2 are set analog mode��so these two bits can be not set
			| P0MDOUT_B3__PUSH_PULL	    						//set p0.3 push pull is used for TEC enable
			| P0MDOUT_B4__OPEN_DRAIN | P0MDOUT_B5__OPEN_DRAIN    //set p0.4 push pull and p0.5 open drain is uesd for uart0
			| P0MDOUT_B6__OPEN_DRAIN							//because the p0.6 are set analog mode��so this bit can be not set
			| P0MDOUT_B7__OPEN_DRAIN;						    //set p0.7 open drain is used for QSFP interrupt output


