paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_lr4_301_drv.c
	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P0SKIP = P0SKIP_B0__SKIPPED					//because P1.2 and p1.3 are used to Smbus,so P0.0 ~ P0.7 must be skipped
			| P0SKIP_B1__SKIPPED| P0SKIP_B2__SKIPPED   //because p0.1 and p0.2 are set analog mode ,so the two bits must be skipped are used for monitor TEC current and voltage
			| P0SKIP_B3__SKIPPED
			| P0SKIP_B4__NOT_SKIPPED | P0SKIP_B5__NOT_SKIPPED
			| P0SKIP_B6__SKIPPED 				//because p0.6 is set analog mode ,so this bit must be skipped are used for mointor thermal resistor temperature
			| P0SKIP_B7__SKIPPED;

	//5. set p0MASK
	P0MASK = P0MASK_B0__IGNORED | P0MASK_B1__IGNORED | P0MASK_B2__IGNORED
			| P0MASK_B3__IGNORED | P0MASK_B4__IGNORED | P0MASK_B5__IGNORED
			| P0MASK_B6__IGNORED | P0MASK_B7__IGNORED;

	//6. set P0MAT
	P0MAT = P0MAT_B0__HIGH | P0MAT_B1__HIGH | P0MAT_B2__HIGH | P0MAT_B3__HIGH
			| P0MAT_B4__HIGH | P0MAT_B5__HIGH | P0MAT_B6__HIGH | P0MAT_B7__HIGH;
#endif

#if defined(HW_VER_AM2_301) || defined(HW_VER_AM3_301)
	P0 = P0_B0__HIGH | P0_B1__HIGH | P0_B2__HIGH | P0_B3__LOW | P0_B4__HIGH | P0_B5__HIGH | P0_B6__HIGH | P0_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P0MDIN = P0MDIN_B0__DIGITAL   					   //set p0.0 digital mode  is used for TX circuit voltage enable
			| P0MDIN_B1__DIGITAL | P0MDIN_B2__DIGITAL    //set p0.1 and p0.2 analog mode is used for monitor TEC current and voltage
			| P0MDIN_B3__DIGITAL 					   //set p0.3 digital mode is used for TEC enable
			| P0MDIN_B4__DIGITAL | P0MDIN_B5__DIGITAL  //set p0.4 and p0.5 digital mode is used for uart0
			| P0MDIN_B6__ANALOG 					   //set p0.6 analog mode is used for mointor thermal resistor  temperature
			| P0MDIN_B7__ANALOG;					   //set p0.7 digital mode is used for QSFP  interrupt output


	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P0MDOUT = P0MDOUT_B0__OPEN_DRAIN    							//set p0.0 push pull is used for TX circuit voltage enable
			| P0MDOUT_B1__OPEN_DRAIN | P0MDOUT_B2__OPEN_DRAIN	//because the p0.1 and p0.2 are set analog mode��so these two bits can be not set
			| P0MDOUT_B3__PUSH_PULL	    						//set p0.3 push pull is used for TEC enable
			| P0MDOUT_B4__OPEN_DRAIN | P0MDOUT_B5__OPEN_DRAIN    //set p0.4 push pull and p0.5 open drain is uesd for uart0
			| P0MDOUT_B6__OPEN_DRAIN							//because the p0.6 are set analog mode��so this bit can be not set
			| P0MDOUT_B7__OPEN_DRAIN;						    //set p0.7 open drain is used for QSFP interrupt output


	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P0SKIP = P0SKIP_B0__SKIPPED					//because P1.2 and p1.3 are used to Smbus,so P0.0 ~ P0.7 must be skipped
			| P0SKIP_B1__SKIPPED| P0SKIP_B2__SKIPPED   //because p0.1 and p0.2 are set analog mode ,so the two bits must be skipped are used for monitor TEC current and voltage
			| P0SKIP_B3__SKIPPED
			| P0SKIP_B4__SKIPPED | P0SKIP_B5__SKIPPED
			| P0SKIP_B6__SKIPPED 				//because p0.6 is set analog mode ,so this bit must be skipped are used for mointor thermal resistor temperature
			| P0SKIP_B7__SKIPPED;

	//5. set p0MASK
	P0MASK = P1MASK_B0__COMPARED | P0MASK_B1__IGNORED | P0MASK_B2__IGNORED
			| P0MASK_B3__IGNORED | P0MASK_B4__IGNORED | P0MASK_B5__IGNORED
			| P0MASK_B6__IGNORED | P0MASK_B7__IGNORED;

	//6. set P0MAT
	P0MAT = P0MAT_B0__HIGH | P0MAT_B1__HIGH | P0MAT_B2__HIGH | P0MAT_B3__HIGH
			| P0MAT_B4__HIGH | P0MAT_B5__HIGH | P0MAT_B6__HIGH | P0MAT_B7__HIGH;
#endif


#if defined(HW_VER_AM4_301)
	P0 = P0_B0__HIGH | P0_B1__HIGH | P0_B2__HIGH | P0_B3__LOW | P0_B4__HIGH | P0_B5__HIGH | P0_B6__HIGH | P0_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P0MDIN = P0MDIN_B0__DIGITAL   					   //set p0.0 digital mode  is used for TX circuit voltage enable
			| P0MDIN_B1__DIGITAL | P0MDIN_B2__DIGITAL    //set p0.1 and p0.2 analog mode is used for monitor TEC current and voltage
			| P0MDIN_B3__DIGITAL 					   //set p0.3 digital mode is used for TEC enable
			| P0MDIN_B4__DIGITAL | P0MDIN_B5__DIGITAL  //set p0.4 and p0.5 digital mode is used for uart0
			| P0MDIN_B6__ANALOG 					   //set p0.6 analog mode is used for mointor thermal resistor  temperature
			| P0MDIN_B7__DIGITAL;					   //set p0.7 digital mode is used for QSFP  interrupt output


	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P0MDOUT = P0MDOUT_B0__OPEN_DRAIN    							//set p0.0 push pull is used for TX circuit voltage enable
			| P0MDOUT_B1__OPEN_DRAIN | P0MDOUT_B2__OPEN_DRAIN	//because the p0.1 and p0.2 are set analog mode��so these two bits can be not set
			| P0MDOUT_B3__PUSH_PULL	    						//set p0.3 push pull is used for TEC enable
			| P0MDOUT_B4__OPEN_DRAIN | P0MDOUT_B5__OPEN_DRAIN    //set p0.4 push pull and p0.5 open drain is uesd for uart0
			| P0MDOUT_B6__OPEN_DRAIN							//because the p0.6 are set analog mode��so this bit can be not set
			| P0MDOUT_B7__OPEN_DRAIN;						    //set p0.7 open drain is used for QSFP interrupt output


	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P0SKIP = P0SKIP_B0__SKIPPED					//because P1.2 and p1.3 are used to Smbus,so P0.0 ~ P0.7 must be skipped
			| P0SKIP_B1__SKIPPED| P0SKIP_B2__SKIPPED   //because p0.1 and p0.2 are set analog mode ,so the two bits must be skipped are used for monitor TEC current and voltage
			| P0SKIP_B3__SKIPPED
			| P0SKIP_B4__SKIPPED | P0SKIP_B5__SKIPPED
			| P0SKIP_B6__SKIPPED 				//because p0.6 is set analog mode ,so this bit must be skipped are used for mointor thermal resistor temperature
			| P0SKIP_B7__SKIPPED;

	//5. set p0MASK
	P0MASK = P1MASK_B0__COMPARED | P0MASK_B1__IGNORED | P0MASK_B2__IGNORED
			| P0MASK_B3__IGNORED | P0MASK_B4__IGNORED | P0MASK_B5__IGNORED
			| P0MASK_B6__IGNORED | P0MASK_B7__COMPARED;

	//6. set P0MAT
	P0MAT = P0MAT_B0__HIGH | P0MAT_B1__HIGH | P0MAT_B2__HIGH | P0MAT_B3__HIGH
			| P0MAT_B4__HIGH | P0MAT_B5__HIGH | P0MAT_B6__HIGH | P0MAT_B7__HIGH;
#endif
	SFRPAGE = SFRPAGE_SAVE;
}

static void _lr4_301_port1_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

