paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_lr4_301_drv.c
	SFRPAGE = 0x0;
	//1.set port default value
#ifdef HW_VER_AM1_301
	P1 = P1_B0__LOW | P1_B1__LOW | P1_B2__HIGH | P1_B3__HIGH | P1_B4__HIGH | P1_B5__HIGH | P1_B6__HIGH | P1_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P1MDIN = P1MDIN_B0__ANALOG  					   //set p1.0 analog mode is used for mointor the 3.3V module input voltage
			| P1MDIN_B1__DIGITAL 					   //set p1.1 digital mode is used for TX close signal
			| P1MDIN_B2__DIGITAL | P1MDIN_B3__DIGITAL  //set p1.2 and p1.3 digital mode is used for i2c master mode

			//set p1.4 ~ p1.7 analog mode are used for MPD0 ~ MPD3
			| P1MDIN_B4__ANALOG  | P1MDIN_B5__ANALOG | P1MDIN_B6__ANALOG | P1MDIN_B7__ANALOG;

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P1MDOUT = P1MDOUT_B0__OPEN_DRAIN    			  			//because the p1.1 are set analog mode��so this bit can be not set
			| P1MDOUT_B1__PUSH_PULL					  			//set p1.1 push pull mode is used for TX close signal
			| P1MDOUT_B2__OPEN_DRAIN | P1MDOUT_B3__OPEN_DRAIN	//because p1.2 and p1.3 are used for i2c master mode,so the two bits must be open drain

			//because the p1.4 ~ p1.7 are set analog mode��so these bits can be not set
			| P1MDOUT_B4__OPEN_DRAIN | P1MDOUT_B5__OPEN_DRAIN  | P1MDOUT_B6__OPEN_DRAIN	| P1MDOUT_B7__OPEN_DRAIN;

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P1SKIP = P1SKIP_B0__SKIPPED 			//because p1.0 is set analog mode and p1.2 and p1.3 are used to Smbus ,so this bit must be skipped are used for mointor the 3.3V module input voltage
			| P1SKIP_B1__SKIPPED			//set p1.1 skip in order to p1.2 and p1.3 are used for i2c master mode
			| P1SKIP_B2__NOT_SKIPPED | P1SKIP_B3__NOT_SKIPPED

			//because p1.4 ~ p1.7 are set analog mode ,so these bits must be skipped are used for for MPD0 ~ MPD3
			| P1SKIP_B4__SKIPPED | P1SKIP_B5__SKIPPED | P1SKIP_B6__SKIPPED | P1SKIP_B7__SKIPPED;

	//5. set p1MASK
	P1MASK = P1MASK_B0__IGNORED | P1MASK_B1__IGNORED | P1MASK_B2__IGNORED
			| P1MASK_B3__IGNORED | P1MASK_B4__IGNORED | P1MASK_B5__IGNORED
			| P1MASK_B6__IGNORED | P1MASK_B7__IGNORED;

	//6. set P1MAT
	P1MAT = P1MAT_B0__HIGH | P1MAT_B1__HIGH | P1MAT_B2__HIGH | P1MAT_B3__HIGH
			| P1MAT_B4__HIGH | P1MAT_B5__HIGH | P1MAT_B6__HIGH | P1MAT_B7__HIGH;
#endif

#if defined(HW_VER_AM2_301) || defined(HW_VER_AM3_301) || defined(HW_VER_AM4_301)
	P1 = P1_B0__HIGH | P1_B1__LOW | P1_B2__LOW | P1_B3__LOW | P1_B4__HIGH | P1_B5__HIGH | P1_B6__HIGH | P1_B7__HIGH;

		//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
		P1MDIN = P1MDIN_B0__ANALOG  					   //set p1.0 analog mode is used for mointor the 3.3V module input voltage
				| P1MDIN_B1__DIGITAL 					   //set p1.1 digital mode is used for TX close signal
				| P1MDIN_B2__DIGITAL | P1MDIN_B3__DIGITAL  //set p1.2 and p1.3 digital mode is used for i2c master mode
				//set p1.4 ~ p1.7 analog mode are used for MPD0 ~ MPD3
				| P1MDIN_B4__ANALOG  | P1MDIN_B5__ANALOG | P1MDIN_B6__ANALOG | P1MDIN_B7__ANALOG;

		//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
		P1MDOUT = P1MDOUT_B0__OPEN_DRAIN    			  			//because the p1.1 are set analog mode��so this bit can be not set
				| P1MDOUT_B1__PUSH_PULL					  			//set p1.1 push pull mode is used for TX close signal
				| P1MDOUT_B2__OPEN_DRAIN | P1MDOUT_B3__OPEN_DRAIN	//because p1.2 and p1.3 are used for i2c master mode,so the two bits must be open drain
				//because the p1.4 ~ p1.7 are set analog mode��so these bits can be not set
				| P1MDOUT_B4__OPEN_DRAIN | P1MDOUT_B5__OPEN_DRAIN  | P1MDOUT_B6__OPEN_DRAIN	| P1MDOUT_B7__OPEN_DRAIN;

		//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
		P1SKIP = P1SKIP_B0__SKIPPED 			//because p1.0 is set analog mode and p1.2 and p1.3 are used to Smbus ,so this bit must be skipped are used for mointor the 3.3V module input voltage
				| P1SKIP_B1__SKIPPED			//set p1.1 skip in order to p1.2 and p1.3 are used for i2c master mode
				| P1SKIP_B2__NOT_SKIPPED | P1SKIP_B3__NOT_SKIPPED

				//because p1.4 ~ p1.7 are set analog mode ,so these bits must be skipped are used for for MPD0 ~ MPD3
				| P1SKIP_B4__SKIPPED | P1SKIP_B5__SKIPPED | P1SKIP_B6__SKIPPED | P1SKIP_B7__SKIPPED;

		//5. set p1MASK
		P1MASK = P1MASK_B0__IGNORED | P1MASK_B1__IGNORED | P1MASK_B2__IGNORED
				| P1MASK_B3__IGNORED | P1MASK_B4__IGNORED | P1MASK_B5__IGNORED
				| P1MASK_B6__IGNORED | P1MASK_B7__IGNORED;

		//6. set P1MAT
		P1MAT = P1MAT_B0__HIGH | P1MAT_B1__HIGH | P1MAT_B2__HIGH | P1MAT_B3__HIGH
				| P1MAT_B4__HIGH | P1MAT_B5__HIGH | P1MAT_B6__HIGH | P1MAT_B7__HIGH;
#endif

	SFRPAGE = SFRPAGE_SAVE;
}

static void _lr4_301_port2_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
#ifdef HW_VER_AM1_301
	P2 = P2_B0__HIGH | P2_B1__HIGH | P2_B2__HIGH | P2_B3__HIGH | P2_B4__HIGH | P2_B5__HIGH | P2_B6__HIGH ;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P2MDIN = P2MDIN_B0__DIGITAL | P2MDIN_B1__DIGITAL	 //set p2.0 and p2.1 digital mode are used for i2c slave mode

			| P2MDIN_B2__DIGITAL   //set  p2.2 digital mode is used for tosa reset signal

			//p2.3 ~ p2.6  analog mode are used for RSSI0 ~ RSSI3
			| P2MDIN_B3__ANALOG | P2MDIN_B4__ANALOG | P2MDIN_B5__ANALOG | P2MDIN_B6__ANALOG ;

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).

	P2MDOUT = P2MDOUT_B0__OPEN_DRAIN | P2MDOUT_B1__OPEN_DRAIN //set p2.0 and p2.1 open drain mode are used for i2c slave mode

			| P2MDOUT_B2__PUSH_PULL  //set  p2.2 push pull is used for tosa reset signal

			//because the p2.3 ~ p2.6 are set analog mode��so these bits can be not set
			| P2MDOUT_B3__OPEN_DRAIN | P2MDOUT_B4__OPEN_DRAIN | P2MDOUT_B5__OPEN_DRAIN  | P2MDOUT_B6__OPEN_DRAIN;


