paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_lr4_301_drv.c
	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P2SKIP = P2SKIP_B0__SKIPPED | P2SKIP_B1__SKIPPED   		//set p2.0 and p2.1 skipped for i2c slave mode
			| P2SKIP_B2__SKIPPED

			//because p2.3 ~ p2.6 are set analog mode ,so these bits must be skipped are used for for RSSI0 ~ RSSI3
			| P2SKIP_B3__SKIPPED | 0x10 | 0x20 | 0x40;


	//5. set p2MASK
	P2MASK = P2MASK_B0__IGNORED | P2MASK_B1__IGNORED | P2MASK_B2__IGNORED
			| P2MASK_B3__IGNORED | P2MASK_B4__IGNORED | P2MASK_B5__IGNORED
			| P2MASK_B6__IGNORED ;

	//6. set P2MAT
	P2MAT = P2MAT_B0__HIGH | P2MAT_B1__HIGH | P2MAT_B2__HIGH | P2MAT_B3__HIGH
			| P2MAT_B4__HIGH | P2MAT_B5__HIGH | P2MAT_B6__HIGH ;
#endif

#if defined(HW_VER_AM2_301) || defined(HW_VER_AM3_301) || defined(HW_VER_AM4_301)
	P2 = P2_B0__HIGH | P2_B1__HIGH | P2_B2__HIGH | P2_B3__HIGH | P2_B4__HIGH | P2_B5__HIGH | P2_B6__HIGH ;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P2MDIN = P2MDIN_B0__DIGITAL | P2MDIN_B1__DIGITAL	 //set p2.0 and p2.1 digital mode are used for i2c slave mode

			| P2MDIN_B2__ANALOG   //set  p2.2 digital mode is used for tosa reset signal

			//p2.3 ~ p2.6  analog mode are used for RSSI0 ~ RSSI3
			| P2MDIN_B3__ANALOG | P2MDIN_B4__ANALOG | P2MDIN_B5__ANALOG | P2MDIN_B6__ANALOG ;

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).

	P2MDOUT = P2MDOUT_B0__OPEN_DRAIN | P2MDOUT_B1__OPEN_DRAIN //set p2.0 and p2.1 open drain mode are used for i2c slave mode

			| P2MDOUT_B2__OPEN_DRAIN   //set  p2.2 push pull is used for tosa reset signal

			//because the p2.3 ~ p2.6 are set analog mode��so these bits can be not set
			| P2MDOUT_B3__OPEN_DRAIN | P2MDOUT_B4__OPEN_DRAIN | P2MDOUT_B5__OPEN_DRAIN  | P2MDOUT_B6__OPEN_DRAIN;


	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P2SKIP = P2SKIP_B0__SKIPPED | P2SKIP_B1__SKIPPED   		//set p2.0 and p2.1 skipped for i2c slave mode
			| P2SKIP_B2__SKIPPED

			//because p2.3 ~ p2.6 are set analog mode ,so these bits must be skipped are used for for RSSI0 ~ RSSI3
			| P2SKIP_B3__SKIPPED | 0x10 | 0x20 | 0x40;


	//5. set p2MASK
	P2MASK = P2MASK_B0__IGNORED | P2MASK_B1__IGNORED | P2MASK_B2__IGNORED
			| P2MASK_B3__IGNORED | P2MASK_B4__IGNORED | P2MASK_B5__IGNORED
			| P2MASK_B6__IGNORED ;

	//6. set P2MAT
	P2MAT = P2MAT_B0__HIGH | P2MAT_B1__HIGH | P2MAT_B2__HIGH | P2MAT_B3__HIGH
			| P2MAT_B4__HIGH | P2MAT_B5__HIGH | P2MAT_B6__HIGH ;
#endif

	SFRPAGE = SFRPAGE_SAVE;
}

static void _lr4_301_port3_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
#ifdef HW_VER_AM1_301
	P3 = P3_B0__HIGH | P3_B1__HIGH | P3_B2__HIGH | P3_B3__HIGH | P3_B4__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P3MDIN = P3MDIN_B0__DIGITAL    //set p3.0 digital mode is used for qsfp low power mode

			| P3MDIN_B1__DIGITAL   //set p3.1 digital mode is used for DAC

			| P3MDIN_B2__DIGITAL   //set p3.2 digital mode is used for i2c slave mode chip selection signal

			| P3MDIN_B3__DIGITAL   //set p3.3 digital mode is used for qsfp module reset

			| P3MDIN_B4__DIGITAL;   //set p3.4 digital mode is used for tx circuit 1.8 voltage enable

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P3MDOUT = P3MDOUT_B0__PUSH_PULL  //set p3.0 push pull is used for qsfp low power mode

			| P3MDOUT_B1__OPEN_DRAIN //set p3.1 open drain mode is used for DAC

			| P3MDOUT_B2__OPEN_DRAIN  //set p3.2 push pull is used for i2c slave mode chip selection signal

			| P3MDOUT_B3__PUSH_PULL  //set p3.3 push pull  is used for qsfp module reset

			| P3MDOUT_B4__PUSH_PULL;  //set p3.4 push pull is used for tx circuit voltage enable
#endif

#if defined(HW_VER_AM2_301) || defined(HW_VER_AM3_301)

#if defined(HW_VER_AM2_301)
	P3 = P3_B0__HIGH | P3_B1__HIGH | P3_B2__HIGH | P3_B3__HIGH | P3_B4__HIGH;
#else
	P3 = P3_B0__HIGH | P3_B1__LOW | P3_B2__HIGH | P3_B3__HIGH | P3_B4__LOW;
#endif
	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P3MDIN = P3MDIN_B0__DIGITAL    //set p3.0 digital mode is used for qsfp low power mode

			| P3MDIN_B1__DIGITAL   //set p3.1 digital mode is used for DAC

			| P3MDIN_B2__DIGITAL   //set p3.2 digital mode is used for i2c slave mode chip selection signal

			| P3MDIN_B3__DIGITAL   //set p3.3 digital mode is used for qsfp module reset

			| P3MDIN_B4__DIGITAL;   //set p3.4 digital mode is used for tx circuit 1.8 voltage enable

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P3MDOUT = P3MDOUT_B0__OPEN_DRAIN  //set p3.0 push pull is used for qsfp low power mode

			| P3MDOUT_B1__PUSH_PULL //set p3.1 open drain mode is used for DAC

			| P3MDOUT_B2__PUSH_PULL  //set p3.2 push pull is used for i2c slave mode chip selection signal

			| P3MDOUT_B3__OPEN_DRAIN  //set p3.3 push pull  is used for qsfp module reset

			| P3MDOUT_B4__PUSH_PULL;  //set p3.4 push pull is used for tx circuit voltage enable
#endif


#if defined(HW_VER_AM4_301)
	P3 = P3_B0__HIGH | P3_B1__LOW | P3_B2__HIGH | P3_B3__HIGH | P3_B4__LOW;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P3MDIN = P3MDIN_B0__DIGITAL    //set p3.0 digital mode is used for qsfp low power mode

			| P3MDIN_B1__DIGITAL   //set p3.1 digital mode is used for DAC

			| P3MDIN_B2__DIGITAL   //set p3.2 digital mode is used for i2c slave mode chip selection signal

			| P3MDIN_B3__DIGITAL   //set p3.3 digital mode is used for qsfp module reset

			| P3MDIN_B4__DIGITAL;   //set p3.4 digital mode is used for tx circuit 1.8 voltage enable

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P3MDOUT = P3MDOUT_B0__OPEN_DRAIN  //set p3.0 push pull is used for qsfp low power mode

			| P3MDOUT_B1__PUSH_PULL //set p3.1 open drain mode is used for DAC

			| P3MDOUT_B2__OPEN_DRAIN  //set p3.2 push pull is used for i2c slave mode chip selection signal

			| P3MDOUT_B3__OPEN_DRAIN  //set p3.3 push pull  is used for qsfp module reset

			| P3MDOUT_B4__PUSH_PULL;  //set p3.4 push pull is used for tx circuit voltage enable
#endif
	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).

	//p3 do't have p3SKIP registers

	//5. set p2MASK
	//p3 do't have P3MASK registers

	//6. set P2MAT
	//p3 do't have P3MAT registers
	SFRPAGE = SFRPAGE_SAVE;
}

static void _lr4_301_txcdr_m37049_reset()
{
	if(_lr4_301_txcdr_check_exist())
	{
		_i2c_dev_ready |= TX_READY;
	}

	_lr4_301_txcdr_m37049_i2c_write_byte(M3704X_RESET,0xaa);
}

static void _lr4_301_rxcdr_m37046_reset()
{
	if(_lr4_301_rxcdr_check_exist())
	{
		_i2c_dev_ready |= RX_READY;
	}

