paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_lr4_301_drv.c
	_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_RESET, 0xaa);  	//rxcdr reset
	TIMER_soft_delay_ms(100);
}

static void _lr4_301_tosa_m4820_reset()
{
	uint8_t value = 0x1;
	uint16_t counter = 0;

	if(_lr4_301_tosa_check_exist())
	{
		_i2c_dev_ready |= TOSA_READY;
	}

	TOSA_RST = 0;
	TIMER_soft_delay_ms(10);
	TOSA_RST = 1;

	while(value)
	{
		_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGE0_RESET, &value);
		counter ++;
		TIMER_soft_delay_ms(counter * 2);
		if(counter >= 100)
		{
			MSA_p2_log("\r\ntosa reset failed");
			return;
		}
	}
}

static void _lr4_301_txcdr_m37049_init()
{
	_lr4_301_txcdr_m37049_reset();
	_lr4_301_txcdr_m37049_i2c_write_byte(M3704X_MODE_CH(2),0x04);
	_lr4_301_txcdr_m37049_i2c_write_byte(M3704X_MODE_CH(3),0x04);
//	_lr4_301_txcdr_m37049_i2c_write_byte(M3704X_OUTPUT_DEEMPH,0x58);
}

static void _lr4_301_rxcdr_m37046_init()
{
	_lr4_301_rxcdr_m37046_reset();
	_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_MODE,0x00);
	_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_LOS_THRS,0x15);
//	_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_OUTPUT_DEEMPH,0x58);
}


static uint8_t _lr4_301_tasa_m4820_value(uint8_t ch,SFP_DRV_LASER_CFG_T *cfg)
{
	uint8_t page;
	static code uint8_t mod_reg[][2]   = {{0x05,TOSA_PAGEN_VO1},{0x05,TOSA_PAGEN_VO2},{0x07,TOSA_PAGEN_VO1},{0x07,TOSA_PAGEN_VO2}};
	static code uint8_t cross_reg[][2] = {{0x04,TOSA_PAGEN_VO1},{0x04,TOSA_PAGEN_VO2},{0x06,TOSA_PAGEN_VO1},{0x06,TOSA_PAGEN_VO2}};

	ch = 3 - ch;

	_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,(uint8_t*)&page);

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,ch+4);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGEN_GAIN_ADJUST,(uint8_t)cfg->bias);   //VB

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,mod_reg[ch][0]);
	_lr4_301_tosa_m4820_i2c_write_byte(mod_reg[ch][1],(uint8_t)cfg->mod);			//VC

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,cross_reg[ch][0]);
	_lr4_301_tosa_m4820_i2c_write_byte(cross_reg[ch][1],(uint8_t)cfg->cross);		//VX

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,page);

	return GOS_OK;
}
static void _lr4_301_tosa_m4820_init()
{
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x00);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x04);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x05);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x06);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x07);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGEN_AGC_ENABLE,0x00);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0x00);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_CHX_SHUTDOW,0xff);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_ADC_ENABLE_II,0xe0);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_ADC_ENABLE_II+1,0x01);
}

/************************************ Public Interface Drv API *************************************/
void LR4_301_chip_reset()
{
	_lr4_301_txcdr_m37049_reset();
	_lr4_301_rxcdr_m37046_reset();
	_lr4_301_tosa_m4820_reset();
}

void LR4_301_chip_init()
{

	LR4_301_chip_reset();
	_lr4_301_txcdr_m37049_init();
	_lr4_301_rxcdr_m37046_init();
	_lr4_301_tosa_m4820_init();
}

void LR4_301_port_init()
{
	_lr4_301_port0_init();
	_lr4_301_port1_init();
	_lr4_301_port2_init();
	_lr4_301_port3_init();
}


int16_t  LR4_301_ddmi_get_temp(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return ((int16_t)((float)(ddmi_cali->temp) * TIMER_temp_slow_boot_cal()) + ADC0_get_mcu_temp());  		//MSA format uint: 1/256 C
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  ADC0_get_mcu_temp();  //uint: 1/256 C
	}

	return GOS_FAIL;

}

uint16_t LR4_301_ddmi_get_vcc(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return (ddmi_cali->vcc + ADC0_get_vcc()); //uint:0.1mv
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return ADC0_get_vcc(); //uint:0.1mv
	}
	return 0;
}

static uint16_t _lr4_301_get_bias_average_value()
{
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};
	uint8_t i = 0, value_h = 0, value_l = 0;

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGEN_EXTERNAL_SOURCE_II,(uint8_t*)&value_l);
		_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGEN_EXTERNAL_SOURCE_II+1,(uint8_t*)&value_h);
		buff16[i] = value_l | (value_h << 8);
	}

	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

static uint16_t _lr4_301_get_ddm_bias(uint8_t channel)
{
	uint16_t  value16 = 0;
	uint8_t page;

	channel = 3 - channel;
	_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,(uint8_t*)&page);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE, channel+4);
	value16 = _lr4_301_get_bias_average_value();
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE, page);
	return (uint16_t)((float)value16 * 0.0568);
}

uint16_t LR4_301_ddmi_get_bias(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		uint16_t bias = 0;
		float bias_temp_cali = 0.0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T	 *laser_stat = MSA_p4_get_laser_state();
		const SFP_DRV_LASER_CFG_T *lo_cfg = (SFP_DRV_LASER_CFG_T *)MSA_p67_get_drv_lut();
		const SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);

		if(MSA_p67_check_apc_lut_tab(lo_cfg))  //apc paramters is invalid, so there is no need to apc calibration
		{
			const int16_t cur_temp = ADC0_get_mcu_temp();

			if(cur_temp <= (m_cfg + channel)->temp)  //low temp
			{
				bias_temp_cali = (float)(cur_temp - (m_cfg + channel)->temp) / (float)TEMP_SCALE * 0.1;
			}
			else  //high temp
			{
				bias_temp_cali = (float)(cur_temp - (m_cfg + channel)->temp) / (float)TEMP_SCALE * 0.56;
			}
		}

		bias  = (uint16_t)((((float)laser_stat->ch[channel].stat.txbias + ddmi_cali->current[channel].bias.bias_offset2  - ddmi_cali->current[channel].bias.bias_offset1) * 0.1 + bias_temp_cali)  * 1000.0 * 0.5); //uint:2uA
		return  bias;//uint:2uA
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)((_lr4_301_get_ddm_bias(channel)) *10);  //0.1mA
	}
	return GOS_FAIL;
}

