paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_lr4_301_drv.c
static uint16_t _lr4_301_get_ddm_rssi(uint8_t channel)
{
	return  (uint16_t)(((float)ADC0_get_rssi(channel)*0.1)/(float)RSSI_SERIES_RES* 1000.00);
}

uint16_t LR4_301_ddmi_get_rx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float rxpower_result = 0.0 ,rxpower1 = 0.0, rxpower2 = 0.0, rssi1 = 0.0, rssi2 = 0.0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		*laser_stat = MSA_p4_get_laser_state();

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rxpower1 uint:0.1uw
		rxpower1 = (float)ddmi_cali->current[channel].rxpower.rxpower1 * 0.1 / 1000.0;  //uint:mW
		rxpower2 = (float)ddmi_cali->current[channel].rxpower.rxpower2 * 0.1 / 1000.0;  //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rssi1 uint:uA
		rssi1 	 = (float)ddmi_cali->current[channel].rxpower.rssi1;
		rssi2 	 = (float)ddmi_cali->current[channel].rxpower.rssi2;

		if(rssi2 != rssi1)
		{
			  rxpower_result = rxpower1 + ((float)laser_stat->ch[channel].stat.rssi - rssi1) * ((rxpower2 - rxpower1) / (rssi2 - rssi1));  //uint: mW
		}

		CHECK_POWER_MIN(rxpower_result);
		CHECK_POWER_MAX(rxpower_result);
		return (uint16_t)(rxpower_result * 10.0 * 1000.0);  //MSA format uint:0.1uW
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  _lr4_301_get_ddm_rssi(channel);  //uint:uA (uint16_t)((float)rssi_mv / (float)RSSI_SERIES_RES * 1000.00);  //uA
	}
	return GOS_FAIL;
}

static uint16_t _lr4_301_get_ddm_mpd(uint8_t channel)
{
	channel = 3 - channel;
	return ADC0_get_mpd(channel);
}

uint16_t LR4_301_ddmi_get_tx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float  txmon_N = 0.0;
		float txpower_result = 0.0, txpower1 = 0.0, txpower2 = 0.0, bias1 = 0.0, bias2 = 0.0;
		const DDMI_CALI_PARA_T    *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		  *laser_stat = MSA_p4_get_laser_state();

		txmon_N =(float)laser_stat->ch[channel].stat.txpwr*0.1 ;

		//ddmi_cali->tx_rx_pwr[channel].txpower.txpower uint:0.1uw
		txpower1 = (float)ddmi_cali->current[channel].txpower.txpower1 * 0.1 / 1000.0; //uint:mW
		txpower2 = (float)ddmi_cali->current[channel].txpower.txpower2 * 0.1 / 1000.0; //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].txpower.bias uint:0.1mA
		bias1 = (float)ddmi_cali->current[channel].txpower.bias1 * 0.1; //uint:mA
		bias2 = (float)ddmi_cali->current[channel].txpower.bias2 * 0.1; //uint:mA

		if(bias1 != bias2)
		{
			txpower_result = txpower1 + (txpower1 - txpower2)/(bias1 - bias2) * (txmon_N - bias1);  //uint:mW
		}

		CHECK_POWER_MIN(txpower_result);
		CHECK_POWER_MAX(txpower_result);
		return (uint16_t)(txpower_result * 1000.0 * 10.0); //MSA format uint:0.1uW
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return _lr4_301_get_ddm_mpd(channel); // uint:0閵嗭拷mA
	}
	return GOS_FAIL;
}

void LR4_301_drv_adjust_laser_ch(uint8_t ch, SFP_DRV_LASER_CFG_T *cfg)
{
	_lr4_301_tasa_m4820_value(ch,cfg);
}

void LR4_301_drv_get_laser_full_state(uint8_t ch, MSA_LUT_T *lut)
{
	uint8_t page,bias, mod, cross;
	static code uint8_t mod_reg[][2]   = {{0x05,TOSA_PAGEN_VO1},{0x05,TOSA_PAGEN_VO2},{0x07,TOSA_PAGEN_VO1},{0x07,TOSA_PAGEN_VO2}};
	static code uint8_t cross_reg[][2] = {{0x04,TOSA_PAGEN_VO1},{0x04,TOSA_PAGEN_VO2},{0x06,TOSA_PAGEN_VO1},{0x06,TOSA_PAGEN_VO2}};

	lut->temp = DDM_GET_TEMP(MSA_DRV_VAL_HW);
	_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,(uint8_t*)&page);

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,(3 - ch)+4);
	_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGEN_GAIN_ADJUST,&bias);   //VB

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,mod_reg[(3 - ch)][0]);
	_lr4_301_tosa_m4820_i2c_read_byte(mod_reg[(3 - ch)][1],&mod);			//VC

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,cross_reg[(3 - ch)][0]);
	_lr4_301_tosa_m4820_i2c_read_byte(cross_reg[(3 - ch)][1],&cross);		//VX

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,page);

	lut->ch[ch].config.bias = (uint16_t)bias;
	lut->ch[ch].config.mod  = (uint16_t)mod;
	lut->ch[ch].config.cross = (uint16_t)cross;
}


void LR4_301_drv_poll()
{
	ADC0_poll();
}

static void  _lr4_301_drv_check_laser_ch(SFP_DRV_LASER_CFG_T *cfg)
{
	if(cfg->bias >= 255)
	{
		cfg->bias = 255;
	}
	if(cfg->mod >= 255)
	{
		cfg->mod = 255;
	}
	if(cfg->cross >= 255)
	{
		cfg->cross = 255;
	}
}


void LR4_301_drv_ch_calc_cfg(int16_t cur_temp, uint8_t ch, const SFP_DRV_LASER_CFG_T *lut, SFP_DRV_LASER_CFG_T *ret)
{
	SFP_DRV_LASER_CFG_T *lo_cfg = (lut + ch);
	SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);
	SFP_DRV_LASER_CFG_T *hi_cfg = (m_cfg + MSA_CHANNEL_NUM);

	if(!MSA_p67_check_apc_lut_tab(lut))  //apc paramters is invalid, so there is no need to apc calibration
	{
		ret->bias  = 0;
		ret->mod   = 0;
		ret->cross = 0;
		return;
	}

	ret->temp = cur_temp;
	if ((cur_temp <= m_cfg->temp) && (m_cfg->temp != lo_cfg->temp))
	{
		ret->bias = (uint16_t )(floor((double)lo_cfg->bias +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->bias - lo_cfg->bias)/ (m_cfg->temp - lo_cfg->temp))));
		ret->mod = (uint16_t)(floor((double)lo_cfg->mod +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->mod - lo_cfg->mod)/ (m_cfg->temp - lo_cfg->temp))));
		ret->cross = (int16_t)(floor((double)lo_cfg->cross +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->cross - lo_cfg->cross)/ (m_cfg->temp - lo_cfg->temp))));
	}
	else if ((cur_temp > m_cfg->temp) && (m_cfg->temp != hi_cfg->temp))
	{
		ret->bias = (uint16_t )(floor((double)m_cfg->bias +
						((double)(cur_temp - m_cfg->temp)) * ((double)(hi_cfg->bias - m_cfg->bias)/ (hi_cfg->temp - m_cfg->temp))));
		ret->mod = (uint16_t)(floor((double)m_cfg->mod +
						((double)(cur_temp - m_cfg->temp)) * ((double)(hi_cfg->mod - m_cfg->mod)/ (hi_cfg->temp - m_cfg->temp))));
		ret->cross = (int16_t)(floor((double)m_cfg->cross +
						((double)(cur_temp - m_cfg->temp)) * ((double)(hi_cfg->cross - m_cfg->cross)/(hi_cfg->temp - m_cfg->temp))));
	}
	else
	{
		ret->bias  = 0;
		ret->mod   = 0;
		ret->cross = 0;
	}

	_lr4_301_drv_check_laser_ch(ret);
}

void LR4_301_update_dev_ready_status()
{
	_lr4_301_rxcdr_check_exist();  //update  _i2c_dev_ready
	_lr4_301_txcdr_check_exist();  //update  _i2c_dev_ready
}

MSA_INTR_STATUS_T *LR4_301_get_drv_intr_status(uint8_t intr_mask)
{
	static MSA_INTR_STATUS_T status;
	uint16_t ts = 0;
	uint8_t value = 0;

	ts = MSA_get_poll_timestamp();

	if(ts % 10)
	{
		return NULL;
	}

	if(intr_mask & PORT_INTR_TX_FAULT)  //read register until there is a tx fault intr
	{
		_lr4_301_txcdr_m37049_i2c_read_byte(M3704X_LOL_OR_LOS_LOS_STATUS, &value);  //get tx fault
		status.tx_fault = REVERSE_LSB_4BITS(value & 0x0F);
	}

	if(intr_mask & PORT_INTR_TX_LOS)  //read register until there is a tx los intr
	{
		_lr4_301_txcdr_m37049_i2c_read_byte(M3704X_LOS_LOL_STATUS, &value);  //get tx los
		status.tx_los = REVERSE_LSB_4BITS(value & 0x0F);;
	}

