paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_lr4_301_drv.c
	if(intr_mask & PORT_INTR_TX_LOL)  //read register until there is a tx lol intr
	{
		_lr4_301_txcdr_m37049_i2c_read_byte(M3704X_LOS_LOL_STATUS, &value);  //get tx lol
		status.tx_lol = REVERSE_LSB_4BITS(value & 0xF0) >> 4;
	}

	if(intr_mask & PORT_INTR_RX_LOS)  //read register until there is a rx los intr
	{
		_lr4_301_rxcdr_m37046_i2c_read_byte(M3704X_LOS_LOL_STATUS, &value);  //get rx lol
		status.rx_los = (value & 0x0F);
	}

	if(intr_mask & PORT_INTR_RX_LOL)  //read register until there is a rx lol intr
	{
		_lr4_301_rxcdr_m37046_i2c_read_byte(M3704X_LOS_LOL_STATUS, &value);  //get rx lol
		status.rx_lol = (value & 0xF0) >> 4;
	}
	return &status;
}

void LR4_301_set_tec_enable(uint8_t enale)
{
	TX_DIS   =   enale & 0x01;
	TOSA_RST = !(enale & 0x01);
	TEC_EN   = !(enale & 0x01);
}

uint16_t LR4_301_get_tec_tempout()
{
	return PID_get_tempout();
}

uint16_t LR4_301_get_tec_tempset()
{
	return PID_get_tempset();
}

uint16_t LR4_301_get_itec()
{
	return ADC0_get_itec();
}

uint16_t LR4_301_get_vtec()
{
	return ADC0_get_vtec();
}

//MSA Lower Page byte86 for tx disable
void LR4_301_set_tx_enable(uint8_t enale)
{
	uint8_t value = 0,page;

	//tx channel reverse
	enale = REVERSE_LSB_4BITS(enale);
	_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGE0_INDIRECT_PAGE,&page);

	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,0);
	value = (enale & 0x01)|((enale & 0x02)<<1)|((enale & 0x04)<<2)|((enale & 0x08) <<3);
	value = ~((value<<1) | value);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_CHX_SHUTDOW, value);
	_lr4_301_tosa_m4820_i2c_read_byte(TOSA_PAGE0_CHX_SHUTDOW, &value);
	value = ~(value & 0x01)|((value & 0x02)>>1)|((value & 0x04)>>2)|((value & 0x08)>>3);
	_lr4_301_tosa_m4820_i2c_write_byte(TOSA_PAGE0_INDIRECT_PAGE,page);
}

//MSA Lower Page byte93 for power override
void LR4_301_set_low_power(uint8_t enable)
{
	if(enable == 0)
	{
		MSA_pin_set_low_power_mode(1);
		IT01CF |= IT01CF_IN0PL__ACTIVE_HIGH;
		TOSA_RST = 1;
		TEC_EN   = 1;
		TX_DIS = 0;
		SDA_M = 1;
		SCL_M = 1;
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
		TX3V3_EN = 0; //open tx3v3 in order to realize high power mode
		TX1V8_EN = 1;
#endif

#if defined(HW_VER_AM3_301)
		TX1V8_EN = 1;
		TX3V3_EN = 1; //open tx3v3 in order to realize high power mode
#endif

#if defined(HW_VER_AM4_301)
		TX3V3_EN = 1; //open tx3v3 in order to realize high power mode
#endif
	}
	else
	{
		MSA_pin_set_low_power_mode(0);
		IT01CF &= ~IT01CF_IN0PL__ACTIVE_HIGH;
		TOSA_RST = 0;
		TEC_EN   = 0;
		TX_DIS = 1;
		SDA_M = 0;
		SCL_M = 0;
#if defined(HW_VER_AM1_301) || defined(HW_VER_AM2_301)
		TX3V3_EN = 1;  //close tx3v3 in order to realize low power mode
		TX1V8_EN = 0;
#endif

#if defined(HW_VER_AM3_301)
//		TX1V8_EN = 0;
//		TX3V3_EN = 0;  //close tx3v3 in order to realize low power mode
#endif

#if defined(HW_VER_AM4_301)
//		TX3V3_EN = 0;  //close tx3v3 in order to realize low power mode
#endif
	}
}

//MSA Lower Page byte98 for tx and rx cdr control
void LR4_301_set_cdr_control(uint8_t value)
{
	uint8_t tx_cdr_control = 0, rx_cdr_control = 0, tmp = 0,channel;

	//tx channel reverse
	tx_cdr_control = ~REVERSE_LSB_4BITS(((value) & 0xF0) >> 4);
	rx_cdr_control = ~(value & 0x0F);

	for(channel = 0; channel < 4; channel ++)
	{
		_lr4_301_txcdr_m37049_i2c_read_byte(M3704X_MODE_CH(channel),&tmp);
		tmp = CLEAR_BIT(tmp, 5) | (GET_BIT(tx_cdr_control, channel) << 5);
		_lr4_301_txcdr_m37049_i2c_write_byte(M3704X_MODE_CH(channel),tmp);

		_lr4_301_rxcdr_m37046_i2c_read_byte(M3704X_MODE_CH(channel),&tmp);
		tmp = CLEAR_BIT(tmp, 5) | (GET_BIT(rx_cdr_control, channel) << 5);
		_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_MODE_CH(channel),tmp);
	}
}

//MSA Page3 byte234 and byte235 for tx eq
void LR4_301_set_tx_eq(uint8_t channel, uint8_t value)
{
	uint8_t eq_table[11] = {0,0,1,2,2,3,4,4,4,6,7};

	if(value != 0xff)
	{
		value = (eq_table[value & 0x0f]) << 4;
	}
	else
	{
		value = 0x50;
	}

	//tx channel reverse
	channel = 3 - channel;

	_lr4_301_txcdr_m37049_i2c_write_byte(M3704X_SLA_CH(channel),value);
}

//MSA Page3 byte236 and byte237 for rx emphasis
void LR4_301_set_rx_emphasis(uint8_t channel, uint8_t value)
{
	uint8_t de_emph[8] = {0x00,0x03,0x05,0x07,0x09,0x0b,0x0d,0x0f};

	value = (de_emph[value & 0x07]) << 4;
	_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_OUTPUT_DEEMPH_CH(channel),value);
}

//MSA Page3 byte238 and byte239 rx amplitude
void LR4_301_set_rx_amplitude(uint8_t channel, uint8_t value)
{
	uint8_t tmp = 0;
	uint8_t amplitude[4] = {0x00,0x0f,0x1e,0x3c};

	value = amplitude[value & 0x03];

	_lr4_301_rxcdr_m37046_i2c_read_byte(M3704X_OUTPUT_SWING_CH(channel),&tmp);
	tmp = (value & 0x3f)|(tmp & 0xc0);
	_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_OUTPUT_SWING_CH(channel),tmp);
}

//MSA Page3 byte240 sq disable
void LR4_301_set_cdr_sq_disable(uint8_t value)
{
	uint8_t tmp = 0,rx_sq = 0, tx_sq = 0, channel;

	//tx channel reverse
	tx_sq  = REVERSE_LSB_4BITS(value & 0x0F);
	rx_sq  = (value & 0xF0) >> 4;

	for(channel = 0;channel < 4 ;channel++)
	{
		_lr4_301_rxcdr_m37046_i2c_read_byte(M3704X_OUTPUT_SWING_CH(channel),&tmp);
		tmp = CLEAR_BIT(tmp, 7) | (GET_BIT(rx_sq, channel) << 7);
		_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_OUTPUT_SWING_CH(channel),tmp);

		_lr4_301_txcdr_m37049_i2c_read_byte(M3704X_OUTPUT_SWING_CH(channel),&tmp);
		tmp = CLEAR_BIT(tmp, 7) | (GET_BIT(tx_sq, channel) << 7);
		_lr4_301_txcdr_m37049_i2c_write_byte(M3704X_OUTPUT_SWING_CH(channel),tmp);
	}
}

//MSA Page3 byte241 for rx output disable
void  LR4_301_set_rx_output_disable(uint8_t value)
{
	uint8_t tmp = 0, rx_output_disable = 0, channel = 0;

	rx_output_disable = (value & 0xF0) >> 4;

	for(channel = 0; channel < 4; channel++)
	{
		_lr4_301_rxcdr_m37046_i2c_read_byte(M3704X_MODE_CH(channel),&tmp);
		tmp = CLEAR_BIT(tmp, 7) | (GET_BIT(rx_output_disable, channel) << 7);
		_lr4_301_rxcdr_m37046_i2c_write_byte(M3704X_MODE_CH(channel),tmp);
	}

}

//MSA Page3 byte241 for tx adapt eq
void  LR4_301_set_tx_adapt_eq(uint8_t value1, uint8_t value2,uint8_t value3)
{
	uint8_t tmp = 0, tx_adapt_eq = 0,channel;

	tx_adapt_eq = (value1 & 0x0F);

	for(channel = 0; channel < MSA_CHANNEL_NUM; channel ++)
	{
		if(GET_BIT(tx_adapt_eq, channel) == 0x1)
		{
			LR4_301_set_tx_eq(channel,0xff);
		}
		else
		{
			if(channel >= 0x0 && channel < 0x2)
			{
				tmp = ((value2) >> (4 * ((channel + 1) % 2)))& 0x0f;
			}
			else if(channel >= 0x2 && channel < MSA_CHANNEL_NUM)
			{
				tmp = ((value3) >> (4 * ((channel + 1) % 2)))& 0x0f;
			}
			LR4_301_set_tx_eq(channel,tmp& 0x0f);
		}
	}
}
#endif
